{
  "WorkshopId": 3418224643,
  "Title": "Gigantism Plus",
  "Description": "Activates the physical defect Gigantism and changes it's behavior a bit while still retaining it's base game functionality. Gigantism can now be improved upon with mutation points as you level up, making it one of the few, if any defects that can be ranked up to make it useful and somewhat outweigh it's drawbacks.\r\n\r\nI have created and added gigantic fists, a scaling natural weapon that is considered a cudgel and works perfectly with that skill line, that will spawn on all of your arms as a hand, regardless of how many of them you have. They act as standard fists in most ways, besides the fact that they are considered to be a gigantic weapon, giving them an automatic +3 to damage right off the bat. They will also scale with the rank of the Gigantism defect, increasing the base 1d3 damage by d1 every 3 ranks, and 1d every 5. At rank 10 this gives them 3d6+3 damage, with no maximum penetration cap, giving you unlimited utilization of your strength. This makes them a VERY powerful weapon later on, though still easily outclassed by gigantic sized melee weapons, which you can now wield as if they were a standard weapon.\r\n\r\nOn that subject, as are the rules in the standard game, you cannot wear or wield anything that does not have the gigantic tag. This makes things difficult as far as gear hunting goes, for sure. As such I have decided to enable the tinkering mod for gigantic to balance this out so you can add it to your own items. However, keep in mind that this is a Physical Defect, not a standard mutation. It's not meant to make the game easier. Although, once I've figured out how to tag all of a character's items as gigantic on creation, I'd be more than happy to update it with that logic so at least your starting gear will fit you. (Feel free to let me know if you have any ideas on how to do that, if you'd like to be a contributor.) It also does not seem to be available for rapid advancements, and I'm not sure if this is a bug or base game behavior for Defects since I'm not aware of any that can be ranked up, anyway.\r\n\r\nYou also weigh more, and will break non-gigantic chairs and beds, and perhaps other furniture that I have not encountered yet, so be careful where you park your gigantic butt. I've not yet experienced an encounter, but as I've edited the base game logic of gigantism to add in other things... some enemies may have a bit of a boost from now having natural weapons. Do be warned that this has only really been tested by me, so feel free to report any jank I've created, and we'll try and work it out! Otherwise, have fun with your gigantic mutants!",
  "Tags": "Mutation, Balance, Cheat",
  "Visibility": "2",
  "ImagePath": "preview.png"
}