{
  "WorkshopId": 3418224643,
  "Title": "Gigantism Plus",
  "Description": "This mod enhances greatly and enables for character creation, the physical defect Gigantism, retaining its base game functionality while introducing new mechanics. With this mod, Gigantism can be improved with mutation points as you level up, making it a unique defect that can be ranked up to offset its drawbacks and become useful.\r\n\r\n[h2]Updates[/h2]\r\n[list]\r\n[*][b]Crystallinity and Burrowing Claws synergies.[/b] We've added in a ton of modular natural weapon synergies that cover most of the base game mutations available.\r\n[*][b]Hoversled and Backpack enhancements.[/b] Gigantic versions of Hoversled are now available, providing more room! Items with CarryBonus have been patched to get a 1.25x increase across the board.\r\n[*][b]And plenty of bug-fixes![/b][/list]\r\n[h1]Features[/h1]\r\n[list]\r\n[*][b]Gigantic Fists:[/b] A scaling natural weapon considered a cudgel and fully compatible with the cudgel skill line. These fists spawn on all your arms as hands, regardless of their number from mutations and chimeric arms. They act like standard fists but are gigantic weapons, providing an automatic +3 to damage from the start. They scale with the Gigantism defect, increasing from 1d3 damage by d1 every 3 ranks and 1d every 5 ranks. At rank 10, they deal 3d6 damage with no maximum penetration cap, allowing unlimited utilization of your strength. While powerful, they are still outclassed by some gigantic-sized melee weapons, which you can now wield as if they were standard weapons. They also start at a -3 to hit, which raises by 1 every 2 ranks.\r\n\r\n[*][b]Gigantic Gear Only:[/b] As per the standard game rules, you cannot wear or wield anything that lacks the gigantic mod, making gear hunting a challenge. You will however spawn with gigantic gear, despite your calling, if you choose gigantic as a defect. The only items currently not included are the torches. You can also toggle the ability to tinker gigantic items, and the rarity of gigantic items spawning in the world in the options menu. All changes to the options require a new character, and reload of game. All natural weapons will also turn into gigantic weapons, gaining +3 damage.\r\n\r\n[*][b]Weight and Furniture Interaction:[/b] With Gigantism, you weigh more and can break non-gigantic chairs, beds, and other furniture. Be mindful where you park your gigantic butt! You can also carry much more weight by default in the base game, which will be great for carrying around all your newly tinkered gigantic items.\r\n\r\n[*][b]Endgame Softlock Fixed:[/b] In the base game, you are not allowed to enter small spaces as a gigantic creature, which essentially breaks an important endgame quest line. We've added in [b]Hunch[/b] and [b]Straighten Up[/b], two new active abilities that toggle being hunched over, allowing you to squeeze into small spaces. Doing so will lower your QN, MV, and DV, but temporarily give you a bit more AV due to being in a more compressed position. Added compatibility with mods that add small spaces, like [url=https://steamcommunity.com/sharedfiles/filedetails/?id=1683847053]Hearthpyre[/url](unaware of any others at the time, but should work great!).\r\n\r\n[*][b]Elongated Paws:[/b] Added new mutation in the style of the Urshiib! These are an adaptation of the Giant Hands cybernetic found within the base game, and allow you to use gigantic equipment worn on hands and wielded, including missile slots. Plus your quill bear friends will like you a little more since they now have them in order to compliment their triple-jointedness. In combination with Gigantism, this mutation will even allow you to wield gigantic two-handed equipment, single-handed.\r\n\r\n[*][b]Gigantic Creatures:[/b] In the base game creatures were tagged as gigantic, but there was no real indication of their size beyond the description, and they didn't appear to actually have the defect applied to them. Gigantism has been added back to these creatures, given a physical feature so that it shows upon looking at them, and applies to them in every way it would yourself. That includes Templar Mechs and Golems! We've added a couple more to the list that felt appropriate, but feel free to let us know if you find more!\r\n\r\n[*][b]Mutation Synergies:[/b] Natural weapons from mutations don't usually play well together, so we're making an effort to find all related and relevant mutations and adding in compatibility with Gigantism and related mutations. This first pass includes adding in new natural weapon states for combined mutations. This currently includes Gigantic Fists, Elongated Paws, Burrowing Claws, and Crystallinity. Flaming/Freezing Ray will also add to the massive name, granting their temperature changes on hit. It also includes all of their combinations for now, so look forward to wielding Freezing gigantic elongated burrowing crystalline points!\r\n\r\n[*][b]Modular:[/b] In the options menu, you can toggle several features of the mod. Tinkering the gigantic mod on to items, for yourself and for NPCs. The rarity of the gigantic mod on objects in the world. Allowing Rapid Advancement of the mutation as you would any other mutation. Toggling starting with gigantic gear if you're a gigantic character, and toggling on and off whether grenades are effected by this. Most of the options now take effect after a reload of a save, unless otherwise marked.\r\n[/list]\r\n\r\n[h1]Contributing[/h1]\r\n\r\nIf you have any ideas to improve the mod, or want to [url=https://github.com/hyd-n-plyn-syt/Gigantism-Plus]contribute[/url], feel free to let me know or make a request! This mod has primarily been tested by myself and UnderDoug, so please report any issues, and we'll work to resolve them!\r\n\r\n[b]Enjoy your adventure with your gigantic mutants, and have fun![/b]\r\n\r\nIf you'd like to contribute to any of my [url=https://github.com/hyd-n-plyn-syt?tab=repositories]public mods[/url], or [url=ko-fi.com/hydnplynsyt]buy me a coffee[/url], feel free!",
  "Tags": "Mutation,Defect,Balance,Cheat,Harmony",
  "Visibility": "2",
  "ImagePath": "preview.png"
}